{
    "meta_data":
    {
        "meta_desc":
        [
            "ReadyDev propose un CV et une présentation détaillée de son concepteur, Gérard KESSE,",
            "Ingénieur en Electronique Robotique et Informatique Industrielle,",
            "Polytech'Montpellier, France."
        ],
        "meta_cano":"/Presentation/"
    },    
    "avatar":
    {
        "src":"/data/img/defaults/img_avatar.png",
        "alt":"Avatar",
        "width":"40"
    },
    "intro":
    [
        "Je suis <b>Gérard KESSE</b>,<br/>",
        "Ingénieur en Développement Informatique C/C++/Qt,<br/>",
        "Avec à la fois des compétences en Système Embarqué et en Robotique.",
        "Formé à Polytech'Montpellier, Je suis un professionnel de conception de projets",
        "logiciel applicatif ou embarqué dans les secteurs de l'Aéronautique, de la Robotique,",
        "des Drones et de la Vision par Ordinateur. Aussi, Je reste ouvert à d'autres types de secteurs tels que",
        "l'Energie et les Finances."
    ],
    "summary":
    {
        "msg":"Pour ma présentation, Je propose de vous présenter:",
        "list":
        [
            {"name":"Mon parcours scolaire","link":"#Parcours"},
            {"name":"Mes expériences professionnelles","link":"#Experiences"},
            {"name":"Mes compétences","link":"#Competences"},
            {"name":"Mes atouts","link":"#Atouts"}
        ]
    },
    "cursus":
    {
        "msg":
        [
            "Pour ce qui est de mon parcours scolaire:<br><br>",
            "J'ai été en Tunisie pour la préparation d'un diplôme de Technicien",
            "en Electronique Industrielle, ce qui m'a permis d'assimiler les bases de:"
        ],
        "list_icon":"fa fa-check",
        "list":
        [
            ["L'Electronique de Puissance: pour la conception de systèmes d'alimentation",
            "de cartes électroniques."],
            ["L'Electrotechnique: pour la gestion de moteurs."],
            ["L'Automatique: pour la commande de moteurs."],
            ["Les Systèmes Embarqués: pour la programmation de microcontrôleurs."]                       
        ],
        "msg2":
        [
            "A la suite de cette formation, J'ai été fasciné par la facilité apportée par",
            "l'informatique embarquée dans l'élaboration de systèmes électroniques complexes,",
            "ce qui m'a conduit en France pour la préparation d'un diplôme d'Ingénieur en Electronique",
            "Robotique et Informatique Industrielle à Polytech'Montpellier.",
            "Ça été pour moi une belle occasion d'approfondir mes connaissances à la fois",
            "en Système Embarqué et en Robotique.<br/><br/>",
            "J'ai appris à maîtriser:"
        ],
        "list2_icon":"fa fa-check",
        "list2":
        [
            ["La modélisation de robots:",
            "Modèle Géométrique, Modèle Cinématique, Modèle Dynamique."],
            ["La conception de systèmes de commande de robots:",
            "Commande Prédictive, Commande par Régulation PID."],
            ["Le développement de systèmes de génération de trajectoire de robots."]
        ],
        "msg3":
        [
            "À cela s'ajoute un certificat en Informatique et Gestion pour la maîtrise des bases",
            "du traitement de grands volumes de données Big Data sur des des systèmes distribués",
            "Cloud Computing avec l'utilisation des technologies Hadoop et MapReduce."
        ]
    },
    "experience":
    {
        "msg":
        [
            "En ce qui concerne mes expériences professionnelles:"
        ],
        "array_icon":"fa fa-building-o",
        "array":
        [
            {
                "company":"<b>ELECTRONIQUE LAB: Mars 2009</b>",
                "description":
                [
                    "En 2009, J'ai travaillé chez ELECTRONIQUE LAB en tant que Développeur Système Embarqué,",
                    "pour la conception d'une Horloge Numérique à base de Microcontrôleur 8051.<br/>"
                ],
                "info":"Ma mission a été de:",
                "list":
                [
                    ["Réaliser les cartes électroniques des systèmes d'alimentation, de calcul et d'affichage."],
                    ["Implémenter les protocoles de communication I2C et RS232."],
                    ["Développer la structure logicielle de l'ordonnanceur multitâche temps réel: Time-Triggered Architecture,",
                    "une architecture logicielle certitifié pour le développement de systèmes de sécurité critique."]
                ],
                "info2":"Ça été pour moi l'occasion de me familiariser avec:",
                "list2":
                [
                    ["Proteus: pour la simulation de circuits électriques."],
                    ["Eagle: pour le traçage de circuits imprimés."],
                    ["Keil µVision: pour la programmation de microcontrôleurs."]
                ]
            },
            {
                "company":"<b>SITARAIL: Janvier 2010</b>",
                "description":
                [
                    "En 2010, J'ai travaillé auprès de SITARAIL, en tant que Technicien en Maintenance Télécom",
                    "pour assurer la maintenance du canal de transmission téléphonique par fibre optique",
                    "entre différentes stations férroviaires."                            
                ],
                "info":"Ça été pour moi l'occasion d'appréhender:",
                "list":
                [
                    ["L'installation de postes téléphoniques."],
                    ["La configuration de postes téléphoniques."],
                    ["La soudure de fibres optiques."]
                ]
            },
            {
                "company":"<b>ROBOTECH'MONTPELLIER: Septembre 2011</b>",
                "description":
                [
                    "En 2011, J'ai intégré l'équipe de ROBOTECH'MONTPELLIER, en tant que Développeur Robot Mobile",
                    "Vision par Ordinateur, pour la conception d'un logiciel d'identification et de",
                    "réconnaissance d'objets à partir d'une Caméra USB embarquée."
                ],
                "info":"J'ai été conduit à:",
                "list":
                [
                    ["Développer les systèmes d'acquisition et de traitement d'image vidéo."],
                    ["Implémenter les algorithmes de binarisation, de détection de contours, de détection d'objets."],
                    ["Réaliser le module de calcul des positons cartésiennes des objets."]
                ],
                "info2":"Ça été pour moi l'occasion de monter en compétences en:",
                "list2":
                [
                    ["OpenCV: pour le traitement d'image vidéo."],
                    ["Socket: pour l'implémentation de l'architecture Client/Serveur."],
                    ["Multithreading: pour l'exécution de processus en parallèle."],
                    ["Xenomai: pour apporter des concepts de temps réel au noyau UNIX utilisé, Debian."]
                ]
            },
            {
                "company":"<b>CYLEONE: Septembre 2012</b>",
                "description":
                [
                    "En 2012, J'ai travaillé chez CYLEONE, en tant que Développeur Drone Vision par Ordinateur,",
                    "pour la conception de 3 logiciels en Vision Industrielle:"
                ],
                "list":
                [
                    ["Un logiciel d'identification et de recensement de colonie d'oiseaux."],
                    ["Un logiciel de calcul de pourcentage de dégâts de verses de blé."],
                    ["Un logiciel de calcul de stress hydrique de plants de blé."] 
                ],
                "info2":"Ça été pour moi l'occasion d'approfondir mes compétences en:",
                "list2":
                [
                    ["OpenCV: pour le traitement d'image vidéo."],
                    ["Qt: pour la création d'interface homme-machine."],
                    ["Multithreading: pour l'exécution de processus en parallèle."],
                    ["SQL: pour la gestion de base de données des caméras compatibles."],
                    ["C++: pour l'utilisation des concepts de la programmation orientée objet."]
                ]
            },
            {
                "company":"<b>TECHMAHINDRA: Mai 2015</b>",
                "description":
                [
                    "En 2015, J'ai intégré l'équipe de TECHMAHINDRA, en tant que Développeur Aéronautique,",
                    "pour l'évolution et l'optimisation du simulateur de test de vol des avions AIRBUS allant de l'A320 à l'A380."
                ],
                "info":"J'ai été amené à:",
                "list":
                [
                    ["Assurer la portabilité de code sources sur plusieurs cibles."],
                    ["Elaborer un script d'identification de logiciels."],
                    ["Développer un système d'impression des pages de tests."],
                    ["Implémenter une stratégie d'affichage des données en fonction du type."]
                ],
                "info2":"Ça été pour moi l'occasion de renforcer mes capacités en:",
                "list2":
                [
                    ["Qt/ILog Views: pour la création d'interface homme-machine."],
                    ["Multithreading: pour l'exécution de processus en parallèle."],
                    ["DBUS: pour la communication de données inter-processus."],
                    ["Batch: pour l'élaboration de srcipts WINDOWS."],
                    ["Shell: pour l'élaboration de srcipts UNIX."],
                    ["C++: pour l'utilisation des patrons de conception."]
                ]
            },
            {
                "company":"<b>ADENTIS: Février 2016</b>",
                "description":
                [
                    "En 2016, J'ai travaillé auprès  de ADENTIS, en tant que Développeur Informatique,",
                    "pour l'élaboration d'un logiciel de gestion clients à base Qt et Excel."
                ],
                "info":"Ma mission à été de développer les interfaces de:",
                "list":
                [
                    ["Création de clients."],
                    ["Recherche de clients."],
                    ["Modification de clients."],
                    ["Suppression de clients."]
                ],
                "info2":"Ça été pour moi l'occasion d'affiner mes compétences en:",
                "list2":
                [
                    ["Qt: pour la création d'interface homme-machine."],
                    ["SQL: pour la gestion de base de données."],
                    ["VBA: pour la création de Macros et de UserForms sous Excel."],
                    ["Access: pour la gestion de base données sous Excel."]
                ]
            },
            {
                "company":"<b>SOLDATA: Septembre 2016</b>",
                "description":
                [
                    "En 2016, J'ai aussi travaillé chez SOLDATA, en tant que Développeur Génie Civil,",
                    "pour la conception d'un logiciel de génération automatique de rapport capteur au format Excel."
                ],
                "info":"Ma mission a été de:",
                "list":
                [
                    ["Développer un systéme de collecte de données à partir plusieurs bases de données."],
                    ["Implémenter un système de calcul de fidélité, de bruit et de panne capteur."],
                    ["Réaliser un système de génération de rapport capteur au format Excel."]
                ],
                "info2":"Ça été pour moi l'occasion de monter en compétences en:",
                "list2":
                [
                    ["Qt: pour la création d'interface homme-machine."],
                    ["Multithreading: pour l'exécution de processus en parallèle."],
                    ["SQL: pour la gestion des bases de données."],
                    ["GSL: pour les calculs scientifiques."],
                    ["LibXL: pour la génération de feuille Excel."],
                    ["Gestion de mémoire: avec l'utilistation de pointeurs intelligents."]
                ]
            }
        ]
    },
    "skill":
    {
        "description":
        [
            "À propos de mes compétences, Je possède de solides connaissances",
            "en développement C/C++ et dans les technologies liées à ces langages:"
        ],
        "list_icon":"fa fa-check",
        "list":
        [
            ["Je maîtrise les concepts de la programmation orientée objet:<br/>",
            "Polymorphisme, Classes Abstraites, Interfaces."],
            ["J'ai une bonne connaissance de la bibliothèque STL:<br/>",
            "Template, Vector, List, Map."],
            ["J'ai un bon savoir-faire en gestion de mémoire:<br/>",
            "Pointeurs Intelligents, ScopedPointer, SharedPointer."],
            ["J'ai une bonne connaissance de la bibliothèque Boost:<br/>",
            "BoostThread, BoostSerialization."],
            ["J'ai une bonne maîtrise des patrons de conception:<br/>",
            "Design Patterns, Singleton, Fabrique, Observateur, Strategie."],
            ["J'ai un bon savoir-faire en programmation multithreading:<br/>",
            "Threads, Mutex, Semaphores."],
            ["Je maitrîse les concepts de la programmation réseau:<br/>",
            "Sockets, TCP/IP, UDP."],
            ["J'ai de solides connaissances en création d'interface homme-machine avec Qt:<br/>",
            "QtDesigner, QtWidgets, QtCore, QtNetwork, QtSql."],
            ["Je possède une bonne maîtrise de la vision par ordinateur avec OpenCV:<br/>",
            "Filtrage, Seuillage, Segmentation, Détection, Contours, Objets, Mouvements."],
            ["J'ai un bon savoir-faire en gestion de bases de données:<br/>",
            "SQL, SQLite, MySQL, PostgreSQL, Firebird, NoSQL, MongoDB, LevelDB."]
        ]
    },
    "asset":
    {
        "description":
        [
            "Quant à mes atouts, Au fil de mes expériences professionnelles,",
            "J'ai appris à :"
        ],
        "list_icon":"fa fa-check",
        "list":
        [
            ["Être autonome."],
            ["Aimer le travail en équipe."],
            ["Intégrer les valeurs de la méthodologie Agile/Scrum/Sprint."],
            ["Travailler au sein d'un groupe où plusieurs compétences se confrontent."],
            ["Développer une grande capacité d'adaptation et d'intégration au sein d'un groupe",
            "d'envergure internationale."]
        ]
    }
}                                                                                                                                                                                                                    